Ran Plan for 2 projects:

1. dir: `terraform-infrastructure` workspace: `stage`
1. dir: `terraform-infrastructure` workspace: `prod`

### 1. dir: `terraform-infrastructure` workspace: `stage`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.cicd.yandex_compute_instance.instance has been changed
~ resource "yandex_compute_instance" "instance" {
        id                        = "fhm9fjjls887aa6dsf6k"
      + labels                    = {}
        name                      = "cicd-server-stage"
        # (11 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.kub-control.yandex_compute_instance.instance has been changed
~ resource "yandex_compute_instance" "instance" {
        id                        = "fhm5vuafn8l8aktnhlnj"
      + labels                    = {}
        name                      = "kub-control-stage"
        # (11 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.kub-worker1.yandex_compute_instance.instance has been changed
~ resource "yandex_compute_instance" "instance" {
        id                        = "epd2d437gu98ieaco7ad"
      + labels                    = {}
        name                      = "kub-worker1-stage"
        # (11 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.kub-worker2.yandex_compute_instance.instance has been changed
~ resource "yandex_compute_instance" "instance" {
        id                        = "ef35qbljdfj567iv1fsp"
      + labels                    = {}
        name                      = "kub-worker2-stage"
        # (11 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # local_file.inventory has been deleted
- resource "local_file" "inventory" {
      - content              = <<-EOT
            ---
            all:
              hosts:
                control-plane:
                  ansible_host: 51.250.84.156
                worker-node1:
                  ansible_host: 84.201.161.132
                worker-node2:
                  ansible_host: 51.250.36.35
                cicd-server:
                  ansible_host: 51.250.1.8
                  ansible_user: centos
              children:
                kube_control_plane:
                  hosts:
                    control-plane:
                etcd:
                  hosts:
                    control-plane:
                kube_node:
                  hosts:
                    worker-node1:
                    worker-node2:
                k8s_cluster:
                  children:
                    kube_control_plane:
                    kube_node:
                jenkins:
                  hosts:
                    cicd-server:
              vars:
                ansible_connection_type: paramiko
                ansible_user: ubuntu
            
        EOT -> null
      - content_base64sha256 = "b22wZbhDS9v4JIuwIRpCtvu3hLBA72iBZDWtjz8+2O0=" -> null
      - content_base64sha512 = "rVPzKItYCfZ/unGmOqCd6629bN0JR0LUAqGn0rq+xTbevr9q8GjjtbIeSi6c2a6XC1unhAa3EXKZdVMhSWTSuA==" -> null
      - content_md5          = "0c3a82237713700b224ecb542dfbde6b" -> null
      - content_sha1         = "58a6a1e963b23d3164941ef8591ab0cd570e4f58" -> null
      - content_sha256       = "6f6db065b8434bdbf8248bb0211a42b6fbb784b040ef68816435ad8f3f3ed8ed" -> null
      - content_sha512       = "ad53f3288b5809f67fba71a63aa09debadbd6cdd094742d402a1a7d2babec536debebf6af068e3b5b21e4a2e9cd9ae970b5ba78406b71172997553214964d2b8" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "../ansible/hosts-stage.yml" -> null
      - id                   = "58a6a1e963b23d3164941ef8591ab0cd570e4f58" -> null
    }
  # yandex_container_registry.c-reg has been changed
~ resource "yandex_container_registry" "c-reg" {
        id         = "crph8vh2vttkpjehqu3m"
      + labels     = {}
        name       = "c-registry-stage"
        # (3 unchanged attributes hidden)
    }
  # yandex_vpc_network.default has been changed
~ resource "yandex_vpc_network" "default" {
        id         = "enp3g2203f4den9tc0gb"
        name       = "net-stage"
      ~ subnet_ids = [
          + "b0cl5jflvcqo0a43uece",
          + "e2lpseqkhhrf4gvb7j2g",
          + "e9b55gog0of5kfae8qs0",
        ]
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = <<-EOT
            ---
            all:
              hosts:
                control-plane:
                  ansible_host: 51.250.84.156
                worker-node1:
                  ansible_host: 84.201.161.132
                worker-node2:
                  ansible_host: 51.250.36.35
                cicd-server:
                  ansible_host: 51.250.1.8
                  ansible_user: centos
              children:
                kube_control_plane:
                  hosts:
                    control-plane:
                etcd:
                  hosts:
                    control-plane:
                kube_node:
                  hosts:
                    worker-node1:
                    worker-node2:
                k8s_cluster:
                  children:
                    kube_control_plane:
                    kube_node:
                jenkins:
                  hosts:
                    cicd-server:
              vars:
                ansible_connection_type: paramiko
                ansible_user: ubuntu
            
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/hosts-stage.yml"
      + id                   = (known after apply)
    }

  # module.cicd.yandex_compute_instance.instance will be updated in-place
~ resource "yandex_compute_instance" "instance" {
        id                        = "fhm9fjjls887aa6dsf6k"
        name                      = "cicd-server-stage"
        # (12 unchanged attributes hidden)





      ~ resources {
          ~ cores         = 2 -> 4
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.kub-control.yandex_compute_instance.instance will be updated in-place
~ resource "yandex_compute_instance" "instance" {
        id                        = "fhm5vuafn8l8aktnhlnj"
        name                      = "kub-control-stage"
        # (12 unchanged attributes hidden)





      ~ resources {
          ~ cores         = 2 -> 4
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.kub-worker1.yandex_compute_instance.instance will be updated in-place
~ resource "yandex_compute_instance" "instance" {
        id                        = "epd2d437gu98ieaco7ad"
        name                      = "kub-worker1-stage"
        # (12 unchanged attributes hidden)





      ~ resources {
          ~ cores         = 2 -> 4
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.kub-worker2.yandex_compute_instance.instance will be updated in-place
~ resource "yandex_compute_instance" "instance" {
        id                        = "ef35qbljdfj567iv1fsp"
        name                      = "kub-worker2-stage"
        # (12 unchanged attributes hidden)





      ~ resources {
          ~ cores         = 2 -> 4
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-infrastructure -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=Dracula33%252Fdiploma-app-run%252Fterraform-infrastructure%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-infrastructure -w stage`
</details>
Plan: 1 to add, 4 to change, 0 to destroy.

---
### 2. dir: `terraform-infrastructure` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/hosts-prod.yml"
      + id                   = (known after apply)
    }

  # yandex_container_registry.c-reg will be created
+ resource "yandex_container_registry" "c-reg" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "c-registry-prod"
      + status     = (known after apply)
    }

  # yandex_container_registry_iam_binding.puller will be created
+ resource "yandex_container_registry_iam_binding" "puller" {
      + id          = (known after apply)
      + members     = [
          + "system:allUsers",
        ]
      + registry_id = (known after apply)
      + role        = "container-registry.images.puller"
    }

  # yandex_container_registry_iam_binding.pusher will be created
+ resource "yandex_container_registry_iam_binding" "pusher" {
      + id          = (known after apply)
      + members     = [
          + "system:allUsers",
        ]
      + registry_id = (known after apply)
      + role        = "container-registry.images.pusher"
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "net-prod"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.public-a will be created
+ resource "yandex_vpc_subnet" "public-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-a-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.public-b will be created
+ resource "yandex_vpc_subnet" "public-b" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-b-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.9.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.public-c will be created
+ resource "yandex_vpc_subnet" "public-c" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-c-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.8.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

  # module.cicd.yandex_compute_instance.instance will be created
+ resource "yandex_compute_instance" "instance" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + description               = "Дешевая и слабая нода"
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "cicd-server-prod"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                centos:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCyGWu6aO1djvLqQ/Rc2R/HpBxJRin7VVd4d3UfLZQzsPlG/iN4N96F9nbHyJe5QG/2ii9+xneBRadUEYgcbuRPoqVg5XknNSeAYfBBdWEgZNo5QgOrS+Lbjq3rtb+skLhgWbPJyoSogIAePV67+Hyu8J+nIvC2INJmUL2DSbylfu64fvGVjFDftsEHijSDt4WQZZQO6LTvHHNSAV4mJz4qE6CG+QXpVisEKUxQhoiSs++QtyHtK8+Ig8RGQcnvZnSJmyrax3CbqQyQEy72sAlLxb9BM32du6QP1me59qwXRr2PnQO0dfp0sUD1jQssDmM7e5J2C/Y7GgatYcfKQIjmG9Ghg2FsCO3JwsSNwu/CPKEtRV9XbVYWW2+6FjiVQKH6LV/QPhzwc5q7jVXnBoda2fUeMoUz+KaANoIJ+sqxq5sGz7cap4ZG95asljo4NLszwBwXKtBxP3//hMZBA3IABAT4LBYXKdAcYghApVLOawVh8sSijS+wquNJbVZbdyM= vagrant@vagrant
            EOT
        }
      + name                      = "cicd-server-prod"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8jvcoeij6u9se84dt5"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # module.kub-control.yandex_compute_instance.instance will be created
+ resource "yandex_compute_instance" "instance" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + description               = "Дешевая и слабая нода"
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "kub-control-prod"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCyGWu6aO1djvLqQ/Rc2R/HpBxJRin7VVd4d3UfLZQzsPlG/iN4N96F9nbHyJe5QG/2ii9+xneBRadUEYgcbuRPoqVg5XknNSeAYfBBdWEgZNo5QgOrS+Lbjq3rtb+skLhgWbPJyoSogIAePV67+Hyu8J+nIvC2INJmUL2DSbylfu64fvGVjFDftsEHijSDt4WQZZQO6LTvHHNSAV4mJz4qE6CG+QXpVisEKUxQhoiSs++QtyHtK8+Ig8RGQcnvZnSJmyrax3CbqQyQEy72sAlLxb9BM32du6QP1me59qwXRr2PnQO0dfp0sUD1jQssDmM7e5J2C/Y7GgatYcfKQIjmG9Ghg2FsCO3JwsSNwu/CPKEtRV9XbVYWW2+6FjiVQKH6LV/QPhzwc5q7jVXnBoda2fUeMoUz+KaANoIJ+sqxq5sGz7cap4ZG95asljo4NLszwBwXKtBxP3//hMZBA3IABAT4LBYXKdAcYghApVLOawVh8sSijS+wquNJbVZbdyM= vagrant@vagrant
            EOT
        }
      + name                      = "kub-control-prod"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8tckeqoshi403tks4l"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # module.kub-worker1.yandex_compute_instance.instance will be created
+ resource "yandex_compute_instance" "instance" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + description               = "Дешевая и слабая нода"
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "kub-worker1-prod"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCyGWu6aO1djvLqQ/Rc2R/HpBxJRin7VVd4d3UfLZQzsPlG/iN4N96F9nbHyJe5QG/2ii9+xneBRadUEYgcbuRPoqVg5XknNSeAYfBBdWEgZNo5QgOrS+Lbjq3rtb+skLhgWbPJyoSogIAePV67+Hyu8J+nIvC2INJmUL2DSbylfu64fvGVjFDftsEHijSDt4WQZZQO6LTvHHNSAV4mJz4qE6CG+QXpVisEKUxQhoiSs++QtyHtK8+Ig8RGQcnvZnSJmyrax3CbqQyQEy72sAlLxb9BM32du6QP1me59qwXRr2PnQO0dfp0sUD1jQssDmM7e5J2C/Y7GgatYcfKQIjmG9Ghg2FsCO3JwsSNwu/CPKEtRV9XbVYWW2+6FjiVQKH6LV/QPhzwc5q7jVXnBoda2fUeMoUz+KaANoIJ+sqxq5sGz7cap4ZG95asljo4NLszwBwXKtBxP3//hMZBA3IABAT4LBYXKdAcYghApVLOawVh8sSijS+wquNJbVZbdyM= vagrant@vagrant
            EOT
        }
      + name                      = "kub-worker1-prod"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8tckeqoshi403tks4l"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # module.kub-worker2.yandex_compute_instance.instance will be created
+ resource "yandex_compute_instance" "instance" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + description               = "Дешевая и слабая нода"
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "kub-worker2-prod"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCyGWu6aO1djvLqQ/Rc2R/HpBxJRin7VVd4d3UfLZQzsPlG/iN4N96F9nbHyJe5QG/2ii9+xneBRadUEYgcbuRPoqVg5XknNSeAYfBBdWEgZNo5QgOrS+Lbjq3rtb+skLhgWbPJyoSogIAePV67+Hyu8J+nIvC2INJmUL2DSbylfu64fvGVjFDftsEHijSDt4WQZZQO6LTvHHNSAV4mJz4qE6CG+QXpVisEKUxQhoiSs++QtyHtK8+Ig8RGQcnvZnSJmyrax3CbqQyQEy72sAlLxb9BM32du6QP1me59qwXRr2PnQO0dfp0sUD1jQssDmM7e5J2C/Y7GgatYcfKQIjmG9Ghg2FsCO3JwsSNwu/CPKEtRV9XbVYWW2+6FjiVQKH6LV/QPhzwc5q7jVXnBoda2fUeMoUz+KaANoIJ+sqxq5sGz7cap4ZG95asljo4NLszwBwXKtBxP3//hMZBA3IABAT4LBYXKdAcYghApVLOawVh8sSijS+wquNJbVZbdyM= vagrant@vagrant
            EOT
        }
      + name                      = "kub-worker2-prod"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-c"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8tckeqoshi403tks4l"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ external_ip_cicd_server = (known after apply)
+ external_ip_kub_control = (known after apply)
+ external_ip_kub_worker1 = (known after apply)
+ external_ip_kub_worker2 = (known after apply)
+ registry-id             = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-infrastructure -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=Dracula33%252Fdiploma-app-run%252Fterraform-infrastructure%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-infrastructure -w prod`
</details>
Plan: 12 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
